src/Catalogs/Scan_СоставляющиеРасчетаЦеныПродуктов/Scan_СоставляющиеРасчетаЦеныПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоставляющиеРасчетаЦеныПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИтоговыеЦены</name>
      <description>Итоговые цены</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаДилера</name>
      <description>Коэффициенты для цены на дилера</description>
    </items>
    <items>
      <name>КоэффициентыДляЦеныНаКлиента</name>
      <description>Коэффициенты для цены на клиента</description>
    </items>
    <items>
      <name>НерасчетныеСоставляющие</name>
      <description>Нерасчетные составляющие</description>
    </items>
    <items>
      <name>РасчетныеСоставляющие</name>
      <description>Расчетные составляющие</description>
    </items>
    <items>
      <name>СкидкиНаценки</name>
      <description>Скидки, наценки</description>
    </items>
  </predefined>
  <attributes>
    <name>ВариантФормированияРасчета</name>
    <type>
      <types>EnumRef.Scan_ВариантыФормированияРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВКалькуляцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиКалькуляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Применимость</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрядностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЦены</name>
    <type>
      <types>EnumRef.Scan_ТипыСоставляющихРасчетаСоставляющихЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтрокиКалькуляции</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяПакетомУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииПакетаУслуг</name>
    <attributes>
      <name>БазоваяОпция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточнениеЗначенийПоУмолчанию</name>
    <attributes>
      <name>ИдентификаторПрайсЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/Scan_ТипыСоставляющихРасчетаСоставляющихЦены/Scan_ТипыСоставляющихРасчетаСоставляющихЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСоставляющихРасчетаСоставляющихЦены</name>
  <enumValues>
    <name>РасчетнаяСоставляющая</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентДляЦеныDealerNet</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентДляЦеныRetailPrice</name>
  </enumValues>
  <enumValues>
    <name>НерасчетнаяСоставляющая</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ВариантыФормированияРасчетаСоставляющихЦены/Scan_ВариантыФормированияРасчетаСоставляющихЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВариантыФормированияРасчетаСоставляющихЦены</name>
  <enumValues>
    <name>ВводитсяВручную</name>
  </enumValues>
  <enumValues>
    <name>РассчитываетсяПоФормуле</name>
  </enumValues>
  <enumValues>
    <name>РассчитываетсяАвтоматически</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ПринадлежностьСоставляющихКалькуляции/Scan_ПринадлежностьСоставляющихКалькуляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ПринадлежностьСоставляющихКалькуляции</name>
  <enumValues>
    <name>НеЗадана</name>
  </enumValues>
  <enumValues>
    <name>Шасси</name>
  </enumValues>
  <enumValues>
    <name>Надстройка</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Scan_СпецификацияСтандартнойМодели/Scan_СпецификацияСтандартнойМодели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_СпецификацияСтандартнойМодели</name>
  <attributes>
    <name>ДействуетСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСPP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРазделеКалькуляции</name>
    <type>
      <types>CatalogRef.Scan_РазделыКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНадстроек</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикОборудования</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторнирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SOrder</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАннулирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСебестоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НезагруженныеОпции</name>
    <attributes>
      <name>Исполнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Надстройки</name>
    <attributes>
      <name>НоменклатураНадстроек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>НоменклатураНадстроек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_СтатусыЗаявокНаДействие/Scan_СтатусыЗаявокНаДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаДействие</name>
  <predefined>
    <items>
      <name>Аннулирована</name>
      <description>Аннулирована</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ДоставкаЗавершена</name>
      <description>Доставка завершена</description>
    </items>
    <items>
      <name>ЗаявкаОтправлена</name>
      <description>Заявка отправлена</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Новая</name>
      <description>Новая</description>
    </items>
    <items>
      <name>Отклонена</name>
      <description>Отклонена</description>
    </items>
    <items>
      <name>Подтверждена</name>
      <description>Подтверждена</description>
    </items>
  </predefined>
  <attributes>
    <name>НедоступноДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок сортировки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>Цвет заказ-наряда в журналах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_СоставляющиеРасчетаЦеныПродуктов/Forms/ФормаЭлемента/Module.bsl
// Модуль формы элемента справочника "Составляющие расчета цены продуктов (scania)"	

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		УстановитьЗначенияПоУмолчанию();
	КонецЕсли;
	
	Если     Объект.ВыводитьВКалькуляцию 
		И Не Объект.Ссылка.Пустая()
		Тогда
		ЦветСтрокиКалькуляции       = РеквизитФормыВЗначение("Объект").ЦветСтрокиКалькуляции.Получить();
		ЦветТекстаСтрокиКалькуляции = РеквизитФормыВЗначение("Объект").ЦветТекстаСтрокиКалькуляции.Получить();
		ШрифтСтрокиКалькуляции      = РеквизитФормыВЗначение("Объект").ШрифтСтрокиКалькуляции.Получить();
	КонецЕсли;
	
	УстановитьПредупреждениеПриРедактированииИдентификатора();
	УправлениеДиалогомНаСервере();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВыводитьВКалькуляцию Тогда
		ТекущийОбъект.ЦветСтрокиКалькуляции       = Новый ХранилищеЗначения(ЦветСтрокиКалькуляции);
		ТекущийОбъект.ЦветТекстаСтрокиКалькуляции = Новый ХранилищеЗначения(ЦветТекстаСтрокиКалькуляции);
		ТекущийОбъект.ШрифтСтрокиКалькуляции      = Новый ХранилищеЗначения(ШрифтСтрокиКалькуляции);
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 +++
	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
	// Rarus tenkam 11.04.2022 mantis 18433 --- 
  
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПредупреждениеПриРедактированииИдентификатора();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипСоставляющейЦеныПриИзменении(Элемент)
	
	Если    Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныDealerNet")
		Или Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныRetailPrice")
		Тогда
		Объект.ВыводитьВКалькуляцию   = Ложь;
		Объект.НомерСтрокиКалькуляции = "";
		ЦветСтрокиКалькуляции         = Новый Цвет(255, 255, 255);
		ЦветТекстаСтрокиКалькуляции   = Новый Цвет(0, 0, 0);
		ШрифтСтрокиКалькуляции        = Неопределено;
	КонецЕсли;
	
	ТипСоставляющейЦеныПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияРасчетаПриИзменении(Элемент)
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЯвляетсяПакетомУслугПриИзменении(Элемент)
	
	//rarus agar 20.07.2020 16123 ++
	//ЯвляетсяПакетомУслугПриИзмененииНаСервере();
	//rarus agar 20.07.2020 16123 --
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВКалькуляциюПриИзменении(Элемент)
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеЗначенийПоУмолчаниюРазделКалькуляцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивРазделов = ПолучитьРазделыКалькуляцииВРаботе();
	
	СписокРазделов = Новый СписокЗначений;
	СписокРазделов.ЗагрузитьЗначения(МассивРазделов);
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("Элемент", Элемент);
	//
	//ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияВыборРаздела", ЭтотОбъект, ДополнительныеПараметры), СписокРазделов, Элемент);
	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
	
	эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	эОтбор.ПравоеЗначение = СписокРазделов;
	эОтбор.Использование = Истина;
	
	эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
	
	ОткрытьФорму("Справочник.Scan_РазделыКалькуляции.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультатаОповещенияВыборРаздела(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОповещения <> Неопределено Тогда
		Элементы.УточнениеЗначенийПоУмолчанию.ТекущиеДанные.РазделКалькуляции = РезультатОповещения.Значение;
		Элементы.УточнениеЗначенийПоУмолчанию.ЗакончитьРедактированиеСтроки(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УточнениеЗначенийПоУмолчаниюСтандартнаяСпецификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеОтбора = Новый Структура();
	ЗначениеОтбора.Вставить("Статус",          ПредопределенноеЗначение("Справочник.Scan_СтатусыЗаявокНаДействие.ВРаботе"));
	ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	Результат = ОткрытьФорму("Документ.Scan_СпецификацияСтандартнойМодели.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЦветСтрокиКалькуляцииПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаСтрокиКалькуляцииПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШрифтСтрокиКалькуляцииПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьФормулу(Команда)
	
	ПараметрыРедактирования = Новый Структура;
	ПараметрыРедактирования.Вставить("Формула",                  Объект.ФормулаРасчета);
	ПараметрыРедактирования.Вставить("НаименованиеСоставляющей", Объект.Наименование);
	ПараметрыРедактирования.Вставить("Составляющая",             Объект.Ссылка);
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьФормулуЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.Scan_РедактированиеФормулыРасчетаСоставляющей", ПараметрыРедактирования, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт 
	
	Если РезультатРедактирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ФормулаРасчета = РезультатРедактирования.Формула Тогда 
		Возврат;
	КонецЕсли;
	
	ФормулаПриИзмененииНаСервере(РезультатРедактирования);
	
КонецПроцедуры

&НаСервере
Процедура ФормулаПриИзмененииНаСервере(РезультатРедактирования)
	
	Объект.ФормулаРасчета = РезультатРедактирования.Формула;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьФормулу(Команда)
	
	ВычислитьФормулуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	Если Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.КоэффициентыДляЦеныНаДилера") Тогда
		Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныDealerNet");
	ИначеЕсли Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.КоэффициентыДляЦеныНаКлиента") Тогда
		Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныRetailPrice");
	ИначеЕсли Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.РасчетныеСоставляющие") Тогда
		Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.РасчетнаяСоставляющая");
	ИначеЕсли Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.НерасчетныеСоставляющие") Тогда
		Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.НерасчетнаяСоставляющая");
	ИначеЕсли Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ИтоговыеЦены") Тогда
		Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.РасчетнаяСоставляющая");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЦветСтрокиКалькуляции       = Параметры.ЗначениеКопирования.ЦветСтрокиКалькуляции.Получить();
		ЦветТекстаСтрокиКалькуляции = Параметры.ЗначениеКопирования.ЦветТекстаСтрокиКалькуляции.Получить();
		ШрифтСтрокиКалькуляции      = Параметры.ЗначениеКопирования.ШрифтСтрокиКалькуляции.Получить();
	Иначе
		ЦветСтрокиКалькуляции       = Новый Цвет(255, 255, 255);
		ЦветТекстаСтрокиКалькуляции = Новый Цвет(0, 0, 0);
		ШрифтСтрокиКалькуляции      = Неопределено;
		
		Объект.Применимость = ПредопределенноеЗначение("Справочник.Scan_ГруппыПродуктов.ТранспортныеСредства");
		Объект.ВариантФормированияРасчета = ПредопределенноеЗначение("Перечисление.Scan_ВариантыФормированияРасчетаСоставляющихЦены.ВводитсяВручную");
		Объект.Принадлежность = ПредопределенноеЗначение("Перечисление.Scan_ПринадлежностьСоставляющихКалькуляции.НеЗадана");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НаименованиеРус) Тогда
		Объект.Опция = Справочники.Scan_ОпцииПродуктов.НайтиПоНаименованию(Объект.НаименованиеРус, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогомНаСервере()

	// Тип составляющей цены
	Если    Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.КоэффициентыДляЦеныНаДилера")
		Или Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.КоэффициентыДляЦеныНаКлиента")
		Или Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.РасчетныеСоставляющие")
		Или Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.НерасчетныеСоставляющие")
		Или Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.ИтоговыеЦены")
		Тогда
		Элементы.ТипСоставляющейЦены.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Вариант формирования расчета
	//Если Объект.Родитель = ПредопределенноеЗначение("Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов.НерасчетныеСоставляющие") Тогда
		Элементы.ВариантФормированияРасчета.ТолькоПросмотр = Истина;
	//КонецЕсли;
	
	// Настройки калькуляции
	Если    Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныDealerNet")
		Или Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныRetailPrice")
		Тогда
		Элементы.ВыводитьВКалькуляцию.ТолькоПросмотр        = Истина;
		Элементы.НомерСтрокиКалькуляции.ТолькоПросмотр      = Истина;
		Элементы.ЦветСтрокиКалькуляции.ТолькоПросмотр       = Истина;
		Элементы.ЦветТекстаСтрокиКалькуляции.ТолькоПросмотр = Истина;
		Элементы.ШрифтСтрокиКалькуляции.ТолькоПросмотр      = Истина;
		Элементы.Принадлежность.ТолькоПросмотр              = Истина;
	Иначе
		Элементы.ВыводитьВКалькуляцию.ТолькоПросмотр         = Ложь;
		Элементы.НомерСтрокиКалькуляции.ТолькоПросмотр       = Ложь;
		Элементы.ЦветСтрокиКалькуляции.ТолькоПросмотр        = Ложь;
		Элементы.ЦветТекстаСтрокиКалькуляции.ТолькоПросмотр  = Ложь;
		Элементы.ШрифтСтрокиКалькуляции.ТолькоПросмотр       = Ложь;
		Элементы.Принадлежность.ТолькоПросмотр               = Ложь;
	КонецЕсли;
	
	Элементы.НомерСтрокиКалькуляции.Видимость      = Объект.ВыводитьВКалькуляцию;
	Элементы.ЦветСтрокиКалькуляции.Видимость       = Объект.ВыводитьВКалькуляцию;
	Элементы.ЦветТекстаСтрокиКалькуляции.Видимость = Объект.ВыводитьВКалькуляцию;
	Элементы.ШрифтСтрокиКалькуляции.Видимость      = Объект.ВыводитьВКалькуляцию;
	Элементы.Принадлежность.Видимость              = Объект.ВыводитьВКалькуляцию;
	
	// Редактирование формулы и значение по умолчанию
	Если Объект.ВариантФормированияРасчета = ПредопределенноеЗначение("Перечисление.Scan_ВариантыФормированияРасчетаСоставляющихЦены.ВводитсяВручную") Тогда
		Элементы.ГруппаЗаголовокФормулаРасчета.Видимость = Ложь;
		Элементы.ФормулаРасчета.Видимость                = Ложь;
		Элементы.ГруппаВычислениеФормулы.Видимость       = Ложь;
		
		Элементы.ГруппаЗначениеПоУмолчанию.Видимость = Истина;
	ИначеЕсли Объект.ВариантФормированияРасчета = ПредопределенноеЗначение("Перечисление.Scan_ВариантыФормированияРасчетаСоставляющихЦены.РассчитываетсяПоФормуле") Тогда
		Элементы.ГруппаЗаголовокФормулаРасчета.Видимость = Истина;
		Элементы.ФормулаРасчета.Видимость                = Истина;
		Элементы.ГруппаВычислениеФормулы.Видимость       = Истина;
		
		Элементы.ГруппаЗначениеПоУмолчанию.Видимость = Ложь;
	ИначеЕсли Объект.ВариантФормированияРасчета = ПредопределенноеЗначение("Перечисление.Scan_ВариантыФормированияРасчетаСоставляющихЦены.РассчитываетсяАвтоматически") Тогда
		Элементы.ГруппаЗаголовокФормулаРасчета.Видимость = Ложь;
		Элементы.ФормулаРасчета.Видимость                = Ложь;
		Элементы.ГруппаВычислениеФормулы.Видимость       = Ложь;
		
		Элементы.ГруппаЗначениеПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтраницаОпцииПакетаУслуг.Видимость = Объект.ЯвляетсяПакетомУслуг;
	
	Если     Объект.Опция.Пустая()
		И Не Объект.ЯвляетсяПакетомУслуг
		Тогда
		Элементы.ЯвляетсяПакетомУслуг.Подсказка = Нстр("ru = 'При установке флажка будет заполнена опция'; en = 'When checked, the option will be filled'");
	Иначе
		Элементы.ЯвляетсяПакетомУслуг.Подсказка = "";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждениеПриРедактированииИдентификатора()
	
	Если СокрЛП(Объект.Идентификатор) = "" Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", СокрЛП(Объект.Идентификатор));
	Запрос.УстановитьПараметр("Ссылка",        Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
	|	Scan_СоставляющиеРасчетаЦеныПродуктов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Scan_СоставляющиеРасчетаЦеныПродуктов КАК Scan_СоставляющиеРасчетаЦеныПродуктов
	|ГДЕ
	| Scan_СоставляющиеРасчетаЦеныПродуктов.ФормулаРасчета ПОДОБНО ""%"" + &Идентификатор + ""%""
	|	И Scan_СоставляющиеРасчетаЦеныПродуктов.Ссылка <> &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Элементы.Идентификатор.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	Иначе
		МассивСоставляющих = Новый Массив;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивСоставляющих.Добавить(Выборка.Наименование);
		КонецЦикла;
		
		СтрокаСоставляющих = СтрСоединить(МассивСоставляющих, ", ");
		
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Идентификатор используется в формулах других составляющих: %1.';
		                                     |en = 'The identifier is used in the formulas of other components: %1'"),
		                                     СтрокаСоставляющих);
		
		Элементы.Идентификатор.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.Идентификатор.ПредупреждениеПриРедактировании = ТекстПредупреждения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТипСоставляющейЦеныПриИзмененииНаСервере()
	
	Если    Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.РасчетнаяСоставляющая") 
		Или Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныDealerNet") 
		Или Объект.ТипСоставляющейЦены = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоставляющихРасчетаСоставляющихЦены.КоэффициентДляЦеныRetailPrice")
		Тогда
		Объект.ВариантФормированияРасчета = ПредопределенноеЗначение("Перечисление.Scan_ВариантыФормированияРасчетаСоставляющихЦены.РассчитываетсяПоФормуле");
	Иначе
		Объект.ВариантФормированияРасчета = ПредопределенноеЗначение("Перечисление.Scan_ВариантыФормированияРасчетаСоставляющихЦены.ВводитсяВручную");
	КонецЕсли;
		
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьФормулуНаСервере()
	
	РезультатВычисленияФормулы = Scan_ЦенообразованиеСервер.РассчитатьСоставляющую(Объект.Ссылка);
	
КонецПроцедуры	

&НаКлиенте
Процедура УточнениеЗначенийПоУмолчаниюПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если  Не ОтменаРедактирования
		И Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.ИдентификаторПрайсЛиста)
		И Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.РазделКалькуляции)
		И Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.СтандартнаяСпецификация)
		Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо указать идентификатор прайс-листа, или раздел, или спецификацию!'; en = 'ID (ETBO) or Section or STD must be specified!'"), 10);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРазделыКалькуляцииВРаботе()
	
	Возврат Scan_ЦенообразованиеСервер.РазделыКалькуляцииВРаботе();
	
КонецФункции

#КонецОбласти
